Extensions installed on SSH: NUC5i3RYH:
3w36zj6.textlint
bierner.markdown-mermaid
bpruitt-goddard.mermaid-markdown-syntax-highlighting
charliermarsh.ruff
cschlosser.doxdocgen
davidanson.vscode-markdownlint
dracula-theme.theme-dracula
eamodio.gitlens
editorconfig.editorconfig
fabiospampinato.vscode-todo-plus
github.copilot
github.copilot-chat
github.github-vscode-theme
hediet.vscode-drawio
ibm.output-colorizer
johnpapa.vscode-peacock
llvm-vs-code-extensions.vscode-clangd
mechatroner.rainbow-csv
mhutchie.git-graph
mkhl.shfmt
ms-ceintl.vscode-language-pack-ja
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode.cmake-tools
ms-vscode.cpptools
njpwerner.autodocstring
richie5um2.vscode-sort-json
seatonjiang.gitmoji-vscode
shardulm94.trailing-spaces
shuworks.vscode-table-formatter
streetsidesoftware.code-spell-checker
timonwong.shellcheck
usernamehw.errorlens
vscode-icons-team.vscode-icons
